{
    "name": "Синавер Османов",
    "profession": "Веб разработчик",
    "home-page": {
        "title": "Привет, меня зовут",
        "profession": {
            "I-m": "Я",
            "list": { "item1": "Фрилансер", "item2": "Фронтенд разработчик" }
        },
        "description": "Уважаемые читатели портфолио, мне не терпится поделиться с вами своими hard и soft навыками, которые делают меня ценным сотрудником в любой профессиональной среде. Во-первых, к числу моих профессиональных навыков относится владение различными программами, такими как WebStorm, VSCode и Figma. Я также обладаю опытом управления проектами, анализа данных и разработки стратегий цифрового маркетинга. Кроме того, я обладаю сильными техническими навыками в области веб-разработки и языков кодирования, таких как HTML, CSS и JavaScript, React и другие. С другой стороны, мои soft навыки не менее важны, поскольку они играют решающую роль в построении прочных отношений и эффективной коммуникации. Я отличный слушатель, способный ясно излагать идеи и концепции как в письменной, так и в устной форме. Я также являюсь командным игроком, всегда готов протянуть руку помощи и сотрудничать с другими людьми для достижения общих целей. Наконец, я умею решать проблемы, критически и творчески подходить к решению сложных задач. В целом, я уверен, что мое сочетание hard и soft навыков делает меня хорошо подготовленным и ценным дополнением к любой команде. Спасибо, что нашли время ознакомиться с моими навыками и квалификацией.",
        "linkedIn-button": "Мой Linkedin"
    },
    "services-page": {
        "title": "Сервисы",
        "services": {
            "service1": {
                "title": "Разработка Веб сайтов",
                "description": "Я считаю, что для создания успешного продукта, ориентированного на пользователя, важно понимать как дизайн, так и разработку."
            },
            "service2": {
                "title": "Лендинг страницы",
                "description": "В цифровом маркетинге лендинг страница - это отдельная веб-страница, созданная специально для маркетинговой или рекламной компании."
            },
            "service3": {
                "title": "Веб-приложения",
                "description": "Веб-приложение - это компьютерная программа, использующая веб-браузеры и веб-технологии для выполнения задач через Интернет."
            }
        }
    },
    "contact-page": {
        "title": "Контакты",
        "contact-question-title": "Есть ли у вас вопросы ?",
        "contact-question-subtitle": "В ВАШЕМ РАСПОРЯЖЕНИИ",
        "services": {
            "write-me": "Напишите мне",
            "address": "Адрес",
            "mail": "Почта",
            "git": "GitHub"
        },
        "form-title": "Отправьте мне письмо",
        "form-description": "Я ОЧЕНЬ БЫСТРО РЕАГИРУЮ НА СООБЩЕНИЯ",
        "form": {
            "name": "Имя",
            "email": "Почта",
            "subject": "Тематика",
            "message": "Сообщение"
        },
        "form-button": "Отправить сообщение"
    },
    "portfolio-page": {
        "title": "Портфолио",
        "projects-title": "Мои проекты"
    },
    "about-page": {
        "title": "Обо мне",
        "introduce_title": "Я {{name}} и ",
        "introduce_description": "Я работаю над созданием лучшего Интернета - быстрого, простого в использовании, красивого, доступного для всех и не вызывающего разочарования. Я создаю успешные веб-сайты, которые быстро работают, просты в использовании и построены с использованием лучших практик. Мой основной опыт связан с фронтенд-разработкой, но я также увлекаюсь дизайном. Я считаю, что опыт работы как в дизайне, так и в разработке позволяет создать наиболее оптимальный пользовательский опыт.",
        "soft-skills": {
            "title": "Soft навыки",
            "languages": {
                "ru": { "key": "РУССКИЙ", "value": "СВОБОДНЫЙ" },
                "en": { "key": "АНГЛИЙСКИЙ", "value": "B2" }
            },
            "website": "Сайт",
            "email": "Почта",
            "city": { "key": "Город", "value": "Евпатория" },
            "freelance": { "key": "Фриланс", "value": "Доступно" }
        },
        "hire-button": "Нанять",
        "hard-skills": {
            "title": "Hard навыки"
        },
        "education": {
            "title": "Образование",
            "education1": {
                "timeline": "Онлайн-курс",
                "date": {
                    "from": "Июль",
                    "to": "Март"
                },
                "title": "Result School Владилена Минина",
                "text": "Джуниор Фронтенд Разработчик"
            }
        },
        "experience": {
            "title": "Опыт",
            "experience1": {
                "timeline": "Фриланс",
                "date": {
                    "from": "Март",
                    "to": "по настоящее время"
                },
                "title": "Фриланс",
                "texts": {
                    "text1": {
                        "title": "",
                        "subtext": "Занимаюсь разработкой и доработкой сайтов и приложений."
                    }
                }
            },
            "experience2": {
                "timeline": "Крашенников",
                "date": {
                    "from": "Август",
                    "to": "Март"
                },
                "title": "Фронтенд разработчик",
                "texts": {
                    "text1": {
                        "title": "SharePoint: Расширенные формы, таблицы и разработка фронтенда",
                        "subtexts": {
                            "sub1": "Разработка фронтенда с использованием React, Redux Saga, SharePoint.",
                            "sub2": "Создание и обработка запросов SharePoint с помощью CamlBuilder.",
                            "sub3": "Реализация таблиц с запросами сортировки и фильтрации.",
                            "sub4": "Создание 2 форм для создания, редактирования, изменения и удаления элементов таблицы.",
                            "sub5": "Разработка карточки для отображения каждого элемента таблицы с использованием bb.",
                            "sub6": "Использование Binder for SharePoint для загрузки данных между таблицами SharePoint."
                        }
                    },
                    "text2": {
                        "title": "Онлайн-чат Касперского для проведения мероприятий",
                        "subtexts": {
                            "sub1": "Разработка фронтенда с использованием React, Typescript, WebSocket и MongoDB.",
                            "sub2": "Реализация бэкенда при помощи библиотеки react-use-websocket.",
                            "sub3": "Реализация компонента модерируемого чата с возможностью редактирования, изменения и удаления сообщений только для модераторов.",
                            "sub4": "Хранение информации о модераторах в базе данных и управление доступом с помощью токенов.",
                            "sub5": "Фильтрация и загрузка новых сообщений, отображение новых пользователей.",
                            "sub6": "Разработка логики отображения немодерируемых сообщений при отсутствии модератора.",
                            "sub7": "Внедрение счетчиков лайков для каждого сообщения и возможность ответов модератора на сообщения."
                        }
                    },
                    "text3": {
                        "title": "Новостной сайт",
                        "subtexts": {
                            "sub1": "Переработка существующего сайта, улучшение производительности на React и Wordpress.",
                            "sub2": "Использование SSR (Server-Side Rendering) и Redux Saga для оптимизации проекта.",
                            "sub3": "Разработка компонентов и логики отображения новостей на сайте."
                        }
                    }
                }
            },
            "experience3": {
                "timeline": "Rational Vision BVBA",
                "date": {
                    "from": "Август",
                    "to": "Август"
                },
                "title": "Фуллстэк разработчик",
                "texts": {
                    "text1": {
                        "title": "Разработка инновационных SPA-проектов и логики back-end",
                        "subtexts": {
                            "sub1": "Разработка стартап-проектов SPA на React, MongoDB, Express, Rest API and etc.",
                            "sub2": "Обеспечение качества работы стартапа путем проведения полного покрытия тестов e2e-чата с использованием Selenium и Jest.",
                            "sub3": "Отвечал за back-end, включая разработку промежуточного ПО для авторизации и валидации, а также эффективную обработку запросов с помощью Fastify."
                        }
                    },
                    "text2": {
                        "title": "Чат",
                        "subtexts": {
                            "sub1": "Реализация, создание и разработка с базой данных Firebase"
                        }
                    }
                }
            }
        }
    },
    "navigation": {
        "logo": "Портфолио",
        "nav-list": {
            "home": "Главная",
            "about": "Обо мне",
            "contact": "Контакты",
            "services": "Услуги",
            "portfolio": "Портфолио"
        },
        "lang": "Выберите язык"
    }
}
